Перем БДД;

Функция ПолучитьСписокШагов(КонтекстФреймворкаBDD) Экспорт
	БДД = КонтекстФреймворкаBDD;

	ВсеТесты = Новый Массив;

	ВсеТесты.Добавить("ВсеПутемИ");
	ВсеТесты.Добавить("ЯНичегоНеДелаю");
	ВсеТесты.Добавить("НиктоНичегоНеДелает");
	ВсеТесты.Добавить("НичегоНеПроисходит");

	Возврат ВсеТесты;
КонецФункции

//все путем "ПарамДано" и "ПарамНеДано"
//##ВсеПутемИ
Процедура ВсеПутемИ(ПарамДано,ПарамНеДано) Экспорт
КонецПроцедуры

//я ничего не делаю "ПарамКогда"
//##ЯНичегоНеДелаю
Процедура ЯНичегоНеДелаю(ПарамКогда) Экспорт
КонецПроцедуры

//никто ничего не делает "ПарамИ"
//##НиктоНичегоНеДелает
Процедура НиктоНичегоНеДелает(ПарамИ) Экспорт
КонецПроцедуры

//ничего не происходит "ПарамТогда"
//##НичегоНеПроисходит
Процедура НичегоНеПроисходит(ПарамТогда) Экспорт
КонецПроцедуры

