
/////////////////////////////////////////////////////////////////////////////////////////////////
//
// Тест для генератора BDD-шагов сценария в формате OneScript на базе файлов Gherkin
//
/////////////////////////////////////////////////////////////////////////////////////////////////

#Использовать logos
#Использовать asserts

Перем юТест;
Перем Лог;
Перем ЧитательГеркин;

Функция ПолучитьСписокТестов(Знач ЮнитТестирование) Экспорт

	юТест = ЮнитТестирование;
		
	МассивТестов = Новый Массив;
	МассивТестов.Добавить("Тест_ДолженПрочитатьПростойФайлФичи");
	
	Возврат МассивТестов;

КонецФункции

Процедура Тест_ДолженПрочитатьПростойФайлФичи() Экспорт
	
	ЧитательГеркин = Новый ЧитательGherkin;
	ВозможныеКлючевыеСлова = ЧитательГеркин.ВозможныеКлючевыеСлова();
	ВключитьОтладкуЧитателя(УровниЛога.Отладка);
	
	ФайлСценария = Новый Файл(ОбъединитьПути(ТекущийСценарий().Каталог, "fixtures\НичегоНеДелаю.feature"));
	
	РезультатыРазбора = ЧитательГеркин.ПрочитатьФайлСценария(ФайлСценария);
	
	Ожидаем.Что(РезультатыРазбора, "РезультатыРазбора").ИмеетТип("Структура");
	Ожидаем.Что(РезультатыРазбора.Язык, "Язык").Равно("ru");
	
	ДеревоФич = РезультатыРазбора.ДеревоФич;
	Ожидаем.Что(ДеревоФич.Строки, "Ожидали, что найдем правильное число фич").ИмеетДлину(1);

	ТелоФункциональности = "Пустой функционал
		|Как Разработчик
		|Я Хочу чтобы файл фичи успешно прочитался";
		
	Ожидаем.Что(ДеревоФич.Лексема, "Ожидали, что правильно нашли ДеревоФич.Лексема, а это не так").Равно(ВозможныеКлючевыеСлова.Функциональность);
	Ожидаем.Что(ДеревоФич.Тело, "Ожидали, что правильно нашли ДеревоФич.Тело, а это не так").Равно(ТелоФункциональности);
	
	Сценарии = ДеревоФич.Строки;
	Ожидаем.Что(Сценарии, "Ожидали, что найдем правильное число сценариев").ИмеетДлину(1);
	
	Сценарий0 = Сценарии[0];
	Ожидаем.Что(Сценарий0.Лексема, "Ожидали, что правильно нашли Сценарий0.Лексема, а это не так").Равно(ВозможныеКлючевыеСлова.Сценарий);
	Ожидаем.Что(Сценарий0.Тело, "Ожидали, что найдем правильное тело сценария 0, а это не так").Равно("Ничего не делаем");

	Шаги = Сценарий0.Строки;
	Ожидаем.Что(Шаги, "Шаги").ИмеетТип("Массив");
	Ожидаем.Что(Шаги, "Ожидали, что найдем правильное число шагов").ИмеетДлину(2);

	Шаг0 = Шаги[0];
	Ожидаем.Что(Шаг0.Тело, "Ожидали, что найдем правильное тело шага 0, а это не так").Равно("я ничего не делаю");
	Ожидаем.Что(Шаг0.Лексема, "Ожидали, что правильно нашли Шаг0.Лексема, а это не так").Равно(ВозможныеКлючевыеСлова.Когда);

	Шаг1 = Шаги[1];
	Ожидаем.Что(Шаг1.Тело, "Ожидали, что найдем правильное тело шага 1, а это не так").Равно("ничего не происходит");
	Ожидаем.Что(Шаг1.Лексема, "Ожидали, что правильно нашли Шаг1.Лексема, а это не так").Равно(ВозможныеКлючевыеСлова.Тогда);

	НайденныеЛексемы = РезультатыРазбора.НайденныеЛексемы;
	Ожидаем.Что(НайденныеЛексемы, "Ожидали, что найдем правильное число лексем").ИмеетДлину(4);
	Ожидаем.Что(НайденныеЛексемы[0].Лексема, "Ожидали, что найдем правильное число лексем").Равно(ВозможныеКлючевыеСлова.Функциональность);
	Ожидаем.Что(НайденныеЛексемы[1].Лексема, "Ожидали, что найдем правильное число лексем").Равно(ВозможныеКлючевыеСлова.Сценарий);
	Ожидаем.Что(НайденныеЛексемы[2].Лексема, "Ожидали, что найдем правильное число лексем").Равно(ВозможныеКлючевыеСлова.Когда);
	Ожидаем.Что(НайденныеЛексемы[3].Лексема, "Ожидали, что найдем правильное число лексем").Равно(ВозможныеКлючевыеСлова.Тогда);
КонецПроцедуры

Процедура ВключитьОтладкуЧитателя(НовыйУровеньЛога)
	ДопЛог = Логирование.ПолучитьЛог("oscript.app.gherkin-read");
	ДопЛог.УстановитьУровень(НовыйУровеньЛога);
КонецПроцедуры

////////////////////////////////////////////////////////////////////
// Программный интерфейс

Функция Инициализация() 
	Лог = Логирование.ПолучитьЛог("oscript.app.bdd-tests");
	Лог.УстановитьУровень(УровниЛога.Отладка);

	//КаталогСкрипта = Новый Файл(ТекущийСценарий().Источник).Путь;
	ПодключитьСценарий(ОбъединитьПути(ТекущийСценарий().Каталог, "../src/gherkin-read.os"), "ЧитательGherkin");
	ЧитательГеркин = Новый ЧитательGherkin;

КонецФункции

///////////////////////////////////////////////////////////////////
// Точка входа

Инициализация();
