
/////////////////////////////////////////////////////////////////////////////////////////////////
//
// Тест для генератора BDD-шагов сценария в формате OneScript на базе файлов Gherkin
//
/////////////////////////////////////////////////////////////////////////////////////////////////

#Использовать logos
#Использовать asserts
#Использовать tempfiles

Перем юТест;
Перем Лог;
Перем ЧитательГеркин;
Перем ИсполнительБДД;

Функция ПолучитьСписокТестов(Знач ЮнитТестирование) Экспорт

	юТест = ЮнитТестирование;
		
	МассивТестов = Новый Массив;
	МассивТестов.Добавить("Тест_ВыполнитьФичуСПодготовленнымИсполнителемШагов");
	
	Возврат МассивТестов;

КонецФункции

Процедура ПослеЗапускаТеста() Экспорт
	//ВременныеФайлы.Удалить();
КонецПроцедуры

Процедура Тест_ВыполнитьФичуСПодготовленнымИсполнителемШагов() Экспорт
	ФайлФичи = Новый Файл(ОбъединитьПути(ТекущийСценарий().Каталог, "fixtures\НичегоНеДелаю.feature"));
	ВременныйКаталогФичи = ПодготовитьТестовыйКаталогСФичей(ФайлФичи);

	ФайлФичи = Новый Файл(ОбъединитьПути(ВременныйКаталогФичи.ПолноеИмя, "НичегоНеДелаю.feature"));
	
	ВключитьОтладкуИсполнителя(УровниЛога.Отладка);

	ВозможныеСтатусыВыполнения = ИсполнительБДД.ВозможныеСтатусыВыполнения();
	
	
	РезультатыВыполнения = ИсполнительБДД.ВыполнитьФичу(ФайлФичи);

	Ожидаем.Что(РезультатыВыполнения, "Ожидали, что дерево фич будет получено как дерево значений, а это не так").ИмеетТип("ДеревоЗначений");
	
	Функциональность0 = РезультатыВыполнения.Строки[0];
	Ожидаем.Что(Функциональность0.СтатусВыполнения, "Ожидали, что статус выполнения будет пройден, а это не так").Равно(ВозможныеСтатусыВыполнения.Пройден);
	
	// Сценарии = ДеревоФич.Строки;
	// Ожидаем.Что(Сценарии, "Ожидали, что найдем правильное число сценариев").ИмеетДлину(1);
	
	// Сценарий0 = Сценарии[0];
	// Ожидаем.Что(Сценарий0.Лексема, "Ожидали, что правильно нашли Сценарий0.Лексема, а это не так").Равно(ВозможныеКлючевыеСлова.Сценарий);
	// Ожидаем.Что(Сценарий0.Тело, "Ожидали, что найдем правильное тело сценария 0, а это не так").Равно("Ничего не делаем");

	// Шаги = Сценарий0.Строки;
	// Ожидаем.Что(Шаги, "Шаги").ИмеетТип("Массив");
	// Ожидаем.Что(Шаги, "Ожидали, что найдем правильное число шагов").ИмеетДлину(2);

	// Шаг0 = Шаги[0];
	// Ожидаем.Что(Шаг0.Тело, "Ожидали, что найдем правильное тело шага 0, а это не так").Равно("я ничего не делаю");
	// Ожидаем.Что(Шаг0.Лексема, "Ожидали, что правильно нашли Шаг0.Лексема, а это не так").Равно(ВозможныеКлючевыеСлова.Когда);

	// Шаг1 = Шаги[1];
	// Ожидаем.Что(Шаг1.Тело, "Ожидали, что найдем правильное тело шага 1, а это не так").Равно("ничего не происходит");
	// Ожидаем.Что(Шаг1.Лексема, "Ожидали, что правильно нашли Шаг1.Лексема, а это не так").Равно(ВозможныеКлючевыеСлова.Тогда);
КонецПроцедуры

Функция ПодготовитьТестовыйКаталогСФичей(ФайлФичи)
	КаталогФичи = ВременныеФайлы.СоздатьКаталог();
	Лог.Отладка("Использую временный каталог "+КаталогФичи);
	КопироватьФайл(ФайлФичи.ПолноеИмя, ОбъединитьПути(КаталогФичи, ФайлФичи.Имя ));
	
	ИмяИсполнителяШагов = ФайлФичи.ИмяБезРасширения+ ".os";
	КаталогИсполнителяШагов = ОбъединитьПути(КаталогФичи, "step_definitions" );
	СоздатьКаталог(КаталогИсполнителяШагов);
	
	ФайлИсполнителяШагов = Новый Файл(ОбъединитьПути(КаталогИсполнителяШагов, ИмяИсполнителяШагов ));
	КопироватьФайл(ОбъединитьПути(ФайлФичи.Путь, "step_definitions-example", ИмяИсполнителяШагов), ФайлИсполнителяШагов.ПолноеИмя);
	
	Ожидаем.Что(ФайлИсполнителяШагов.Существует(), "Ожидаем, что файл исполнителя шагов существует, а его нет").Равно(Истина);
	Возврат Новый Файл(КаталогФичи);
КонецФункции

Процедура ВключитьОтладкуИсполнителя(НовыйУровеньЛога)
	ДопЛог = Логирование.ПолучитьЛог("oscript.app.bdd-exec");
	ДопЛог.УстановитьУровень(НовыйУровеньЛога);
КонецПроцедуры

////////////////////////////////////////////////////////////////////
// Программный интерфейс

Функция Инициализация() 
	Лог = Логирование.ПолучитьЛог("oscript.app.bdd-tests");
	Лог.УстановитьУровень(УровниЛога.Отладка);

	//КаталогСкрипта = Новый Файл(ТекущийСценарий().Источник).Путь;
	ПодключитьСценарий(ОбъединитьПути(ТекущийСценарий().Каталог, "../src/bdd-exec.os"), "ИсполнительБДД");
	ИсполнительБДД = Новый ИсполнительБДД;

	ПодключитьСценарий(ОбъединитьПути(ТекущийСценарий().Каталог, "../src/gherkin-read.os"), "ЧитательGherkin");
	ЧитательГеркин = Новый ЧитательGherkin;

КонецФункции

///////////////////////////////////////////////////////////////////
// Точка входа

Инициализация();
