# language: ru

Функционал: Таблицы данных
	Как Разработчик
	Я Хочу чтобы можно было использовать различные форматы данных в фича-файлах

Сценарий: Проверяю передачу простой таблицы

  # огда я передаю таблицу
  # | Ячейка11       | Ячейка12|
  # | Ячейка21 | Ячейка22|
  # огда переданная таблица является типом "ТаблицаЗначений"
  #  у переданной таблицы 2 колонки
  #  у переданной таблицы 2 строки
  #  у 1 строки таблицы заданы значения "Ячейка11" и "Ячейка12"
  #  у 2 строки таблицы заданы значения "Ячейка21" и "Ячейка22"