Перем БДД;

Функция ПолучитьСписокШагов(КонтекстФреймворкаBDD) Экспорт
	БДД = КонтекстФреймворкаBDD;
	
	ВсеТесты = Новый Массив;

	ВсеТесты.Добавить("я ничего не делаю");
	ВсеТесты.Добавить("ничего не происходит");
	// ДобавитьШагВМассивТестов(ВсеТесты,"ЯОткрылФормуVanessaBehavoirВРежимеСамотестирования()","ЯОткрылФормуVanessaBehavoirВРежимеСамотестирования","я открыл форму VanessaBehavoir в режиме самотестирования");

	Возврат ВсеТесты;
КонецФункции

//я ничего не делаю
//#НичегоНеДелаю
Процедура ЯНичегоНеДелаю() Экспорт
КонецПроцедуры

//ничего не происходит
//#НичегоНеПроисходит
Процедура НичегоНеПроисходит() Экспорт
КонецПроцедуры

