Перем БДД;
Перем КлючЖурнала;

Функция ПолучитьСписокШагов(КонтекстФреймворкаBDD) Экспорт
	БДД = КонтекстФреймворкаBDD;
	
	ВсеТесты = Новый Массив;

	ВсеТесты.Добавить("я ничего не делаю");
	ВсеТесты.Добавить("ничего не происходит");

	Возврат ВсеТесты;
КонецФункции

Процедура ЯНичегоНеДелаю(ПарамСтрока) Экспорт
	ДобавитьВЖурнал("ЯНичегоНеДелаю");
КонецПроцедуры

Процедура НичегоНеПроисходит(ДругойПарамСтрока) Экспорт
	ДобавитьВЖурнал("НичегоНеПроисходит");
КонецПроцедуры

Процедура ДобавитьВЖурнал(Строка) Экспорт
	Журнал.Вставить(КлючЖурнала, Журнал[КлючЖурнала]+Строка+";");
КонецПроцедуры

КлючЖурнала = (Новый Файл(ТекущийСценарий().Источник)).ИмяБезРасширения;
Журнал.Вставить(КлючЖурнала, "");