# language: ru

Функционал: пропуск сценария в Linux
    Как Пользователь
    Я хочу иметь возможность пропускать сценарии в Linux
    Чтобы я мог проще автоматизировать больше действий на OneScript

Сценарий: я пропускаю этот сценарий в Linux
    Когда я пропускаю этот сценарий в Linux
    Тогда Пауза 1

Сценарий: я не пропускаю этот сценарий
    Когда Пауза 1

# Контекст:
#     Когда я пропускаю этот сценарий в Linux
#     И Пауза 1

# Сценарий: я пропускаю этот сценарий с контекстом в Linux
#     Тогда Пауза 1