# language: ru

Функционал: Макеты падающиюх сценариев

Сценарий: Первый неверный сценарий

	Когда я запускаю падающий шаг с параметром "Первый падающий шаг из первого сценария"
	Тогда до этого шага выполнение дойти не должно

Сценарий: Второй неверный сценарий

	Когда я запускаю падающий шаг с параметром "Первый падающий шаг из второго сценария"
	Тогда до этого шага выполнение дойти не должно

Сценарий: Второй неверный сценарий дубль

	Когда я запускаю падающий шаг с параметром "Первый падающий шаг из дубля второго сценария"
	Тогда до этого шага выполнение дойти не должно
