// Реализация шагов BDD-фич/сценариев c помощью фреймворка https://github.com/artbear/1bdd

Перем БДД; //контекст фреймворка 1bdd
Перем Журнал;

// Метод выдает список шагов, реализованных в данном файле-шагов
Функция ПолучитьСписокШагов(КонтекстФреймворкаBDD) Экспорт
	БДД = КонтекстФреймворкаBDD;

	ВсеШаги = Новый Массив;

	ВсеШаги.Добавить("ЯВыполняюШаг");
	ВсеШаги.Добавить("ЯЗаписываюВЖурнал");
	ВсеШаги.Добавить("ЖурналРавен");

	Возврат ВсеШаги;
КонецФункции

// Реализация шагов

// Процедура выполняется перед запуском каждого сценария
Процедура ПередЗапускомСценария(Знач Узел) Экспорт
	
КонецПроцедуры

// Процедура выполняется после завершения каждого сценария
Процедура ПослеЗапускаСценария(Знач Узел) Экспорт
	
КонецПроцедуры

//я выполняю шаг 'я записываю "ШагСценария" в файл журнала'
Процедура ЯВыполняюШаг(Знач НаименованиеШагаСценария) Экспорт
	БДД.ВыполнитьШаг(НаименованиеШагаСценария);
КонецПроцедуры

//я записываю "ШагСценария" в файл журнала
Процедура ЯЗаписываюВЖурнал(Знач СтрокаДляЖурнала) Экспорт
	Журнал  = СтрШаблон("%1%2;", Журнал, СтрокаДляЖурнала);
КонецПроцедуры

Процедура ЖурналРавен(Знач ОжидаемыйТекстЖурнала) Экспорт
	Ожидаем.Что(Журнал, "Текст журнала равен ожиданию").Равно(ОжидаемыйТекстЖурнала);
КонецПроцедуры
