// Реализация шагов BDD-фич/сценариев c помощью фреймворка https://github.com/artbear/1bdd

Перем БДД; //контекст фреймворка 1bdd

// Метод выдает список шагов, реализованных в данном файле-шагов
Функция ПолучитьСписокШагов(КонтекстФреймворкаBDD) Экспорт
	БДД = КонтекстФреймворкаBDD;

	ВсеШаги = Новый Массив;

	ВсеШаги.Добавить("ЯЗапускаюПадающийШагСПараметром");
	ВсеШаги.Добавить("ДоЭтогоШагаВыполнениеДойтиНеДолжно");

	Возврат ВсеШаги;
КонецФункции

// Реализация шагов

//я запускаю падающий шаг с параметром "Первый падающий шаг"
Процедура ЯЗапускаюПадающийШагСПараметром(Знач ПарамСтрока) Экспорт
	 ВызватьИсключение СтрШаблон("ЯЗапускаюПадающийШагСПараметром-%1", ПарамСтрока);
КонецПроцедуры

//до этого шага выполнение дойти не должно
Процедура ДоЭтогоШагаВыполнениеДойтиНеДолжно() Экспорт
	 ВызватьИсключение "ДоЭтогоШагаВыполнениеДойтиНеДолжно";
КонецПроцедуры

