Перем БДД;
Перем КлючЖурнала;

Функция ПолучитьСписокШагов(КонтекстФреймворкаBDD) Экспорт
	БДД = КонтекстФреймворкаBDD;

	ВсеШаги = Новый Массив;

	ВсеШаги.Добавить("ЯИспользуюИ");
	ВсеШаги.Добавить("ПолучаюИ");
	ВсеШаги.Добавить("ЯПередаюПараметр");
	ВсеШаги.Добавить("ЯПолучаюПараметрСТипом");
	ВсеШаги.Добавить("ЯИспользуюСтроку_В_Которой_Есть_Минус");

	Возврат ВсеШаги;
КонецФункции

//я использую 5 и число2
Процедура ЯИспользуюИ(ПарамЧисло1,ПарамСтрока2) Экспорт
	 ДобавитьВЖурнал("ЯИспользуюИ", ПарамЧисло1, ПарамСтрока2);
КонецПроцедуры

//получаю 10 и сумму12
Процедура ПолучаюИ(ПарамЧисло1,ПарамСтрока2) Экспорт
	ДобавитьВЖурнал("ПолучаюИ", ПарамЧисло1, ПарамСтрока2);
КонецПроцедуры

//я передаю параметр 11.02.2010
Процедура ЯПередаюПараметр(ПарамДата1) Экспорт
	ДобавитьВЖурнал("ЯПередаюПараметр", ПарамДата1);
КонецПроцедуры

//я получаю параметр с типом "Дата"
Процедура ЯПолучаюПараметрСТипом(ПарамСтрока1) Экспорт
	ДобавитьВЖурнал("ЯПолучаюПараметрСТипом", ПарамСтрока1);
КонецПроцедуры

//я использую строку-в-которой-есть-минус
Процедура ЯИспользуюСтроку_в_которой_есть_минус() Экспорт
	ДобавитьВЖурнал("ЯИспользуюСтроку_в_которой_есть_минус");
КонецПроцедуры

Процедура ДобавитьВЖурнал(Строка, Параметр = "", Параметр2 = "") Экспорт
	Журнал.Вставить(КлючЖурнала, Журнал[КлючЖурнала]+Строка+";");

	Представление = СтрШаблон("                нахожусь внутри шага %1 %2, %3", Строка,
		ПредставлениеПараметра(Параметр), ПредставлениеПараметра(Параметр2));
	//Сообщить(Представление);
КонецПроцедуры

Функция ПредставлениеПараметра(Параметр)
	Возврат ?(ПустаяСтрока(Параметр), "", "<"+Параметр+">");
КонецФункции

КлючЖурнала = (Новый Файл(ТекущийСценарий().Источник)).ИмяБезРасширения;
Журнал.Вставить(КлючЖурнала, "");
