// Реализация шагов BDD-фич/сценариев c помощью фреймворка https://github.com/artbear/1bdd

Перем БДД; //контекст фреймворка 1bdd
Перем Лог;

// Метод выдает список шагов, реализованных в данном файле-шагов
Функция ПолучитьСписокШагов(КонтекстФреймворкаBDD) Экспорт
	БДД = КонтекстФреймворкаBDD;

	ВсеШаги = Новый Массив;

	ВсеШаги.Добавить("ЯПропускаюЭтотСценарий");

	Возврат ВсеШаги;
КонецФункции

// Реализация шагов

// я пропускаю этот сценарий
Процедура ЯПропускаюЭтотСценарий() Экспорт
	БДД.ПропуститьСценарий();
КонецПроцедуры

Лог = Логирование.ПолучитьЛог("bdd");
