Перем БДД;

Функция ПолучитьСписокШагов(КонтекстФреймворкаBDD) Экспорт
	БДД = КонтекстФреймворкаBDD;

	ВсеТесты = Новый Массив;

	ВсеТесты.Добавить("ЯПодготовилСпециальнуюТестовуюФичу");
	ВсеТесты.Добавить("ЯЗапустилГенерациюШаговФичи");
	ВсеТесты.Добавить("ЯПолучилСгенерированныйOs_ФайлВОжидаемомКаталоге");
	ВсеТесты.Добавить("СгенерированныйOs_ФайлПрошелПроверкуНаКорректность");

	Возврат ВсеТесты;
КонецФункции

//я подготовил специальную тестовую фичу "ФичаДляПроверкиГенерацииШагов"
//##ЯПодготовилСпециальнуюТестовуюФичу
Процедура ЯПодготовилСпециальнуюТестовуюФичу(ПарамСтрока1) Экспорт
	 ВызватьИсключение "Не реализовано.";
КонецПроцедуры

//я запустил генерацию шагов фичи "ФичаДляПроверкиГенерацииШагов"
//##ЯЗапустилГенерациюШаговФичи
Процедура ЯЗапустилГенерациюШаговФичи(ПарамСтрока1) Экспорт
	 ВызватьИсключение "Не реализовано.";
КонецПроцедуры

//я получил сгенерированный os-файл в ожидаемом каталоге
//##ЯПолучилСгенерированныйOs_ФайлВОжидаемомКаталоге
Процедура ЯПолучилСгенерированныйOs_ФайлВОжидаемомКаталоге() Экспорт
	 ВызватьИсключение "Не реализовано.";
КонецПроцедуры

//сгенерированный os-файл прошел проверку на корректность
//##СгенерированныйOs_ФайлПрошелПроверкуНаКорректность
Процедура СгенерированныйOs_ФайлПрошелПроверкуНаКорректность() Экспорт
	 ВызватьИсключение "Не реализовано.";
КонецПроцедуры

