специальная синтакс-ошибка для получения бага

// // Реализация шагов BDD-фич/сценариев c помощью фреймворка https://github.com/artbear/1bdd

// Перем БДД; //контекст фреймворка 1bdd

// // Метод выдает список шагов, реализованных в данном файле-шагов
// Функция ПолучитьСписокШагов(КонтекстФреймворкаBDD) Экспорт
// 	БДД = КонтекстФреймворкаBDD;

// 	ВсеШаги = Новый Массив;

// 	ВсеШаги.Добавить("ВызовШага_ВРеализацииКоторогоЕстьСинтакс_Ошибка");

// 	Возврат ВсеШаги;
// КонецФункции

// // Реализация шагов

// // Процедура выполняется перед запуском каждого сценария
// Процедура ПередЗапускомСценария(Знач Узел) Экспорт
	
// КонецПроцедуры

// // Процедура выполняется после завершения каждого сценария
// Процедура ПослеЗапускаСценария(Знач Узел) Экспорт
	
// КонецПроцедуры

// //Вызов шага, в реализации которого есть синтакс-ошибка
// Процедура ВызовШага_ВРеализацииКоторогоЕстьСинтакс_Ошибка() Экспорт
// КонецПроцедуры

