Перем БДД;
Перем Журнал;
Перем КлючЖурнала;

Функция ПолучитьСписокШагов(КонтекстФреймворкаBDD) Экспорт
	БДД = КонтекстФреймворкаBDD;

	ВсеШаги = Новый Массив;

	ВсеШаги.Добавить("ЯНичегоНеДелаюВсеПараметры");
	ВсеШаги.Добавить("ВсеПутемИ");
	ВсеШаги.Добавить("НиктоНичегоНеДелаетВсеПараметры");
	ВсеШаги.Добавить("НичегоНеПроисходитВсеПараметры");

	Возврат ВсеШаги;
КонецФункции

// Я ничего не делаю все параметры "ПарамСтрока"
Процедура ЯНичегоНеДелаюВсеПараметры(Знач ПарамСтрока) Экспорт
	ДобавитьВЖурнал("ЯНичегоНеДелаю", ПарамСтрока);
КонецПроцедуры

Процедура ВсеПутемИ(Знач Парам1, Знач Парам2) Экспорт
	ДобавитьВЖурнал("ВсеПутемИ", Парам1, Парам2);
КонецПроцедуры

// Никто ничего не делает все параметры "ПарамСтрока"
Процедура НиктоНичегоНеДелаетВсеПараметры(Знач Парам1) Экспорт
	ДобавитьВЖурнал("НиктоНичегоНеДелает", Парам1);
КонецПроцедуры

// Ничего не происходит все параметры "ПарамСтрока"
Процедура НичегоНеПроисходитВсеПараметры(Знач ДругойПарамСтрока) Экспорт
	ДобавитьВЖурнал("НичегоНеПроисходит", ДругойПарамСтрока);
	Ожидаем.Что(Журнал[КлючЖурнала], "Ожидали, что журнал выполнения будет правильным, а это не так").Равно("ВсеПутемИ<ПарамДано><ПарамНеДано>;ЯНичегоНеДелаю<ПарамКогда>;НиктоНичегоНеДелает<ПарамИ>;НичегоНеПроисходит<ПарамТогда>;");
КонецПроцедуры

Процедура ДобавитьВЖурнал(Строка, Параметр = "", Параметр2 = "") Экспорт
	Журнал.Вставить(КлючЖурнала, Журнал[КлючЖурнала]+Строка+ПредставлениеПараметра(Параметр)+ПредставлениеПараметра(Параметр2)+";");
КонецПроцедуры

Функция ПредставлениеПараметра(Параметр)
	Возврат ?(ПустаяСтрока(Параметр), "", "<"+Параметр+">");
КонецФункции

КлючЖурнала = (Новый Файл(ТекущийСценарий().Источник)).ИмяБезРасширения;
Журнал = Новый Соответствие;
Журнал.Вставить(КлючЖурнала, "");
