// Реализация шагов BDD-фич/сценариев c помощью фреймворка https://github.com/artbear/1bdd

Перем БДД; //контекст фреймворка 1bdd
Перем Лог;

// Метод выдает список шагов, реализованных в данном файле-шагов
Функция ПолучитьСписокШагов(КонтекстФреймворкаBDD) Экспорт
	БДД = КонтекстФреймворкаBDD;

	ВсеШаги = Новый Массив;

	ВсеШаги.Добавить("ЯУстанавливаюСтатусНеВыполнялся");
	ВсеШаги.Добавить("ЯУстанавливаюСтатусПройден");
	ВсеШаги.Добавить("ЯУстанавливаюСтатусНеРеализован");
	ВсеШаги.Добавить("ЯУстанавливаюСтатусСломался");

	Возврат ВсеШаги;
КонецФункции

// Реализация шагов

// я устанавливаю статус Не Выполнялся
Процедура ЯУстанавливаюСтатусНеВыполнялся() Экспорт
	Лог.Информация("Шаг не выполнялся");
	БДД.ПереназначитьСтатусВыполнения(БДД.ВозможныеСтатусыВыполнения().НеВыполнялся);
КонецПроцедуры

// я устанавливаю статус Пройден
Процедура ЯУстанавливаюСтатусПройден() Экспорт
	Лог.Информация("Шаг пройден");
	БДД.ПереназначитьСтатусВыполнения(БДД.ВозможныеСтатусыВыполнения().Пройден);
КонецПроцедуры

// я устанавливаю статус Не Реализован
Процедура ЯУстанавливаюСтатусНеРеализован() Экспорт
	Лог.Информация("Шаг не реализован");
	БДД.ПереназначитьСтатусВыполнения(БДД.ВозможныеСтатусыВыполнения().НеРеализован);
КонецПроцедуры

// я устанавливаю статус Сломался
Процедура ЯУстанавливаюСтатусСломался() Экспорт
	Лог.Информация("Шаг сломался");
	БДД.ПереназначитьСтатусВыполнения(БДД.ВозможныеСтатусыВыполнения().Сломался);
КонецПроцедуры

Лог = Логирование.ПолучитьЛог("bdd");